-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:8889
-- Время создания: Ноя 26 2021 г., 15:03
-- Версия сервера: 5.7.34
-- Версия PHP: 7.4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `stage2_project`
--

-- --------------------------------------------------------

--
-- Структура таблицы `info`
--

CREATE TABLE `info` (
  `id` int(11) NOT NULL,
  `cid` int(4) NOT NULL,
  `title` varchar(255) NOT NULL,
  `url` varchar(255) NOT NULL,
  `descr_min` varchar(1024) NOT NULL,
  `description` text,
  `image` varchar(500) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `info`
--

INSERT INTO `info` (`id`, `cid`, `title`, `url`, `descr_min`, `description`, `image`) VALUES
(1, 1, 'Супертяжёлый вес', 'super-heavyweight', 'Александр Усик победил Энтони Джошуа и стал новым чемпионом мира', 'Большинство главных трофеев в супертяжёлом весе возвращаются в Украину. Долго же здесь ждали после братьев Кличко. Ждали — и почти уже ни на что не надеялись в ближайшие годы. Получить чемпиона-крузера — одно, а взять мировой титул в хэвивейте… Нет, откровенно говоря, на это надежд было немного.\r\n\r\nВ топ-тусовке двухметровых акселератов Александр Усик казался неуместным. С ним, казалось, вскоре разберутся даже не топы, а те, кто на подходе к ним. Посмотрите, сколько скепсиса было как от бойцов, так и практически от всех, кто хоть как-то соприкасается с миром бокса. Скепсиса зачастую вполне оправданного, не с потолка.\r\n\r\nС приближением даты боя мнения потихоньку начали меняться. Чем дальше, тем более сдержанными были прогнозы. Да, оставались и те, кто ставит категорически на того или другого. СМИ таких любят цитировать, но больше как фрик-мнения.', 'pexels-pixabay-70567.jpg'),
(2, 1, 'Тяжёлый вес', 'heavy-weight', 'Арсен Гуламирян (26-0, 18 KO) защитил титул в противостоянии с боксёром из Молдовы Константину Беженару (14-1, 4 KO)\r\n\r\n', 'Претендент-левша здорово начал бой: окучивал чемпиона молниеносными комбинациями, поразил ручной скоростью, работал по этажам. Гуламирян попытался действовать агрессивнее, но вся тактика подопечного Абеля Санчеса сводилась к попыткам зажать Беженару в углу ринга или возле канатов. Получалось не очень — уроженец Молдовы здорово двигался.\r\n\r\nК 4-му раунду Гуламирян выровнял ход боя, а в 5-й трёхминутке отметился парочкой ярких попаданий: потряс Беженару правым прямым, а чуть позже добавил хуком. В 7-м раунде Беженару дважды побывал на канвасе. Рефери решил, что нокдаунов не было, но инициативой завладел чемпион, а претендент выглядел уставшим.\r\n\r\nВ 9-м раунде Гуламирян поймал претендента левым чек-хуком — тот оказался на канвасе. До конца трёхминутки Беженару пропустил шквал атак, но продержался до финального гонга. На 10-й раунд боксёр из Молдовы не вышел.', 'pexels-sides-imagery-3531081.jpg'),
(3, 1, 'Полутяжёлый вес', 'light-heavyweight', 'Дмитрий Бивол победил Крейга Ричердза\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n', 'Поединок начался с традиционной разведки. Ричардс отдал инициативу сопернику, действуя на отходах и контратаках и больше внимания уделяя обороне. Бивол работал первым номером, но зачастую его удары не доходили цели.\r\nВо втором раунде россиянин пристрелялся и стал чаще попадать. В основном проходили прямые удары левой и правой кроссом (через руку соперника). Во втором раунде Биволу удалось даже слегка потрясти соперника, а в третьем россиянин пропустил чувствительный удар и устроил атакующий штурм, британец уверенно отбился и перевел поединок в спокойный темп.', 'pexels-sides-imagery-4007921.jpg'),
(4, 2, 'Игра за чемпионство', 'champ', 'Лондонский Челси победил Манчестер Сити со счетом 1:0 и стал победителем Лиги чемпионов-2020/21. Главный матч клубного евросезона прошел в Порту', 'В 2021 году команды уже встречались трижды. Два раза встречи происходили в рамках Английской премьер-лиги (АПЛ) и один раз – в полуфинале Кубка Англии. В 17-м туре национального первенства победа досталась «горожанам» со счетом 3:1, в борьбе за выход в финал Кубка победу с минимальным счетом одержал лондонский клуб. Перед матчем 35-го тура уже было известно, что финал Лиги чемпионов – английский, и этот поединок называли не иначе как репетицией к заключительной битве главного европейского турнира. Победа тогда досталась подопечным Тухеля – 2:1.', 'pexels-luis-henrique-4219812.jpg'),
(5, 2, 'Игра за третье место', 'third', 'Бавария в матче за третье место победила команду Барселона со счетом 3:0', 'Бавария и Барселона часто встречаются в Лиге чемпионов, и почти всегда матчи между ними получаются результативными и сокрушительными для одной из команд. В сезоне-2019/20 розыгрыш Лиги чемпионов затянулся из-за пандемии коронавируса: 1/4 финала состоялась только в августе и проходила в формате одного матча. В «Барсе» разгонялся кризис из-за длительного застоя в составе и администрации. Унизительный разгром от «Баварии» заставил многое поменяться в клубе. Весь сезон с тоннами критики сталкивался главный тренер каталонцев Кике Сетьен. После позора с «Баварией» исчезли любые аргументы защиты испанца. Тренера выгнали спустя три дня после матча, а решение о его уходе совет директоров принял в течение 24 часов после финального свистка. Кандидатура Роналда Кумана уже некоторое время висела над персоной Сетьена, и на заседании совета ее окончательно утвердили.', 'pexels-riciardus-303353.jpg');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `info`
--
ALTER TABLE `info`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `info`
--
ALTER TABLE `info`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
