<pre>
<?php
//  функции и работы с массивами

$m = [4, 5, 7, 88, 99];  // $m =  array(4, 5, 7, 88, 99); индентичная запись
var_dump($m);

//=========in_array== ПОЗВОЛЯЕТ ПРОВЕРИТЬ НАЛИЧИЕ ЭЛЕМЕНТА В МАССИВЕ, строки и цифры преобразует их в одно
var_dump(in_array(88, $m));  // bool(true)
var_dump(in_array(3, $m));   // bool(false)
var_dump(in_array('88', $m)); // bool(true)
if (in_array(5, $m)) echo 1;
else echo 0;

//======max===== ВОЗВРАЩЯЕТ МАКСИМАЛЬНОЕ ЧИСЛО ИЗ МАССИВА
echo '<br>max: ';
echo max($m);

//====sort====  СОРТИРУЕТ МАССИВ И ВОЗВРАЩАЕТ БУЛЕВОЕ ЗНАЧЕНИЕ
// ИСХОДНЫЙ МАССИВ МЕНЯЕТ
echo '<br>sort: ';
sort($m);
var_dump($m);
print_r($m); // красивый вывод массива

//====arrey_reverse====  ПЕРЕВОРАЧИВАЕТ МАССИВ И ВОЗВРАЩАЕТ ПЕРЕВЕРНУТЫЙ МАССИВ
// ИСХОДНЫЙ МАССИВ НЕ МЕНЯЕТ
echo '<br>revers: ';
$m2 = ['a', 'b', 'c', 'd'];
$b = array_reverse($m2);
print_r($b);

//arrey_push= ДОБАВЛЯЕТ ЭЛЕМЕНТЫ В КОНЕЦ МАССИВА И ВОЗВРАЩАЕТ НОВОЕ КОЛИЧЕСТВО ЭЛЕМЕНТОВ
// ИСХОДНЫЙ МАССИВ МЕНЯЕТ
echo '<br>push: ';
$m3 = ['a', 'b', 'c', 'd'];
array_push($m3, 'hello');
print_r($m3);
$m3[] = 'hi'; // замена push
print_r($m3);
print_r(array_push($m3, 'count'));  // 7  новое количестно элементов

//====arrey_shift= УДАЛЯЕТ ПЕРВЫЙ ЭЛЕМЕНТ МАССИВА И ВОЗВРАЩАЕТ ЭТОТ УДАЛЕННЫЙ ЭЛЕМЕНТ
// ИСХОДНЫЙ МАССИВ МЕНЯЕТ
echo '<br>shift: ';
$m4 = ['a', 'b', 'c', 'd'];
// array_shift($m4);
// print_r($m4);
print_r(array_shift($m4));  // a  ВОЗВРАЩАЕТ ЭТОТ УДАЛЕННЫЙ ЭЛЕМЕНТ

//====arrey_pop= УДАЛЯЕТ ПОСЛЕДНИЙ ЭЛЕМЕНТ МАССИВА И ВОЗВРАЩАЕТ ЭТОТ УДАЛЕННЫЙ ЭЛЕМЕНТ
// ИСХОДНЫЙ МАССИВ МЕНЯЕТ
echo '<br>pop: ';
$m5 = ['a', 'b', 'c', 'd'];
// array_pop($m5);
// print_r($m5);
print_r(array_pop($m5));  // d  ВОЗВРАЩАЕТ ЭТОТ УДАЛЕННЫЙ ЭЛЕМЕНТ
